---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.PointClouds.PointCloudFilter
source: html/f3be0603-e085-8c3f-9ce8-ca3b9f6c508b.htm
---
# PointCloudFilter Members

Returns a copy of the filter. The engine is permitted to copy the filter multiple times e.g. to parallelize filtering.